// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает 
// вторую цифру этого числа.

int value = 782;
int b = (value / 10) % 10;
Console.WriteLine(value);
Console.WriteLine(b);